# taps
tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'hmarr/tap'

# requirements
brew 'ctags'

# terminal apps
brew 'zsh'
brew 'git'
brew 'neovim'
brew 'tldr'
brew 'tree'

# apps
cask 'kitty'
cask 'google-chrome'
cask 'spotify'
cask 'omnifocus'
cask 'fantastical'
cask 'remarkable'
cask 'selfcontrol'

# general utilities
cask 'rectangle'
cask 'vitals'
