# taps
tap 'homebrew/bundle'
tap 'hmarr/tap'
tap 'caarlos0/tap'

# requirements
brew 'ctags'

# terminal tools
brew 'zsh'
brew 'neovim'
brew 'ripgrep'
brew 'git'
brew 'tree'
brew 'tldr'
brew 'exercism'
brew 'caarlos0/tap/timer'
brew 'terminal-notifier' 

# yazi and dependencies
brew 'yazi'
brew 'ffmpegthumbnailer'
brew 'unar'
brew 'jq'
brew 'poppler'
brew 'fd'
brew 'fzf'
brew 'zoxide'
cask 'font-symbols-only-nerd-font'

# apps
cask 'arc'
cask 'discord'
cask 'fantastical'
cask 'figma'
cask 'kitty'
cask 'notion'
cask 'obsidian'
cask 'spotify'

# general utilities
cask 'rectangle'
cask 'vitals'

# App Store
mas 'reMarkable', id: 1276493162
